app/functions.php

select * from `cates` where `cates`.`id` = '1' limit 1
---
function getCateName($id){
    return \App\Cate::findOrFail($id);