app/Http/Controllers/ArticleController.php

    public function index(Request $request){

    	//查询点击进来的这篇文章
    	$article = Article::findOrFail($request->id);

    	//每浏览一次让这篇文章浏览量+1
    	$article->increment('access_count');

    	//查询和这篇文章分类相关的7篇文章
    	$xgArticles = Article::where('cate_id',$article->cate_id)->where('id','!=',$article->id)->limit(7)->get();
---
select * from `articles` where `articles`.`id` = '5' limit 1
update `articles` set `access_count` = `access_count` + 1, `updated_at` = '2018-09-17 17:40:20' where `id` = '5'
select * from `articles` where `cate_id` = '1' and `id` != '5' limit 7