app/Http/Controllers/CateController.php

select * from `cates` where `cates`.`id` = '1' limit 1
select * from `articles` where `cate_id` = '1' order by `time` desc limit 6 offset 0
select count(*) as aggregate from `articles` where `cate_id` = '1'
select * from `cates` where `pid` = '1'
---
    public function index(Request $request){

    	//查询出点击进来的这条分类
    	$cate = Cate::findOrFail($request->id);

    	//查询出这条分类下的文章
    	$articles = Article::where('cate_id',$request->id)->orderBy('time','desc')->paginate(6);

    	//查询相关分类(先判断点击进来的是顶级分类还是子类)
    	if($cate->pid == 0){
    		$xgCates = Cate::where('pid',$cate->id)->get();
    	}else{
    		$xgCates = Cate::where('pid',$cate->pid)->get();