app/Http/Controllers/IndexController.php

    public function index(){
    	// 利用redis做一个缓存遍历分类及文章
		if(Redis::exists('catehs')){
            $catehs = unserialize(Redis::get('catehs'));
        }else{
        	//横条分类遍历
    		$catehs = getCateByPid(Cate::where('check',0)->get());

    		//横条下文章遍历
	    	foreach($catehs as $k=>$cate){
	    		$arr = [];
	    		array_push($arr,$cate->id);
	    		foreach(Cate::where('pid',$cate->id)->get() as $s_cate){
	    			array_push($arr,$s_cate->id);
	    		}

	    		//最新资讯
	    		$cate['newArticles'] = Article::whereIn('cate_id',$arr)->orderBy('time','desc')->limit(11)->get();

	    		//最热资讯
	    		$cate['hotArticles'] = Article::whereIn('cate_id',$arr)->orderBy('access_count','desc')->limit(12)->get();
	    	}

        	Redis::setex('catehs', 86400, serialize($catehs));
        }

        if(Redis::exists('catess')){
        	$catess = unserialize(Redis::get('catess'));
        }else{
        	//竖条分类遍历
    		$catess = getCateByPid(Cate::where('check',1)->get());
---
select * from `cates` where `check` = '0'
select * from `cates` where `pid` = '1'
select * from `articles` where `cate_id` in ('1', '12', '13', '14', '15') order by `time` desc limit 11
select * from `cates` where `check` = '1'

	    	foreach($catess as $k=>$cate){
	    		$arr = [];
	    		array_push($arr,$cate->id);
	    		foreach(Cate::where('pid',$cate->id)->get() as $s_cate){
---
select * from `cates` where `pid` = '6'

	    		}

	    		//最新资讯
	    		$cate['newArticles'] = Article::whereIn('cate_id',$arr)->orderBy('time','desc')->limit(6)->get();

	    		//最热资讯
	    		$cate['hotArticles'] = Article::whereIn('cate_id',$arr)->orderBy('access_count','desc')->limit(3)->get();
---
select * from `articles` where `cate_id` in ('6') order by `time` desc limit 6
select * from `articles` where `cate_id` in ('6') order by `access_count` desc limit 3

        }

        //查询首页的友情链接
        $links = Link::where('status',1)->get();
---
select * from `links` where `status` = '1'